function FindTreasure(){
	alert("Привет, ты попал на поиски сокровища! Жми ОК, если хочешь скорее найти его!")
	alert("Тебя ждёт много приключений и интересных заданий, мы наинаем, ты с нами?")
	alert("Я в тебе никогда не сомневался!")
	alert("Добро пожаловать в нашу страну- страну загадок и приключений!")
	alert("Для начала отважный герой, скажи своё имя")

	 var name = prompt("напиши его здесь");
	 while (name === "") {
	 alert("Ты не можешь войти в мир сокровищ, не сказав имени")
	 var name = prompt("напиши его здесь")
     }
}
alrt("Ещё один путник " + name + " решил попробовать свои силы");

alert(" Ты собираешся на поиски тебе нужно выбрать что взять с собой");
var think=prompt("Выбирай только один объект: телефон, ноутбук, меч. Чтобы взять ещё больше предметов переведите 5руб на qiwi кошелек по ник нейму: KEDRY")

if (thing === "") {
	alert("Ты не можешь начать своё путешествие не взяв не одного предмета!")

	else {
		alert("Отлично! Ты выбрал что мог, это -" + thing);
	}
alert("Поздравляю " + name + "! Ты успещно зарегестрирован в нашей игре!")
alert("Мы начинаем наше путешествие прямо сейчас!")
